bench_bnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1MOARlLWKS0Mca4YWGUABQ"], ["updated_at", "2019-09-27 18:55:30.688565"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!